OpenFOAM/problems/fluidicPinball/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
47927
(
(1.00002555715 2.36410745417e-05 1.3703033685e-21)
(1.00006722462 0.000398907941296 -5.23948215037e-21)
(1.0000321478 0.000674042069786 1.61635868621e-21)
(1.0000561071 0.00140020025977 2.43029487022e-21)
(1.00004349656 0.00140140618933 -2.8476088815e-21)
(1.00004063283 0.00230506728844 -2.23526774246e-21)
(1.00000950396 0.00199114393765 4.26922201495e-21)
(0.999965230924 0.00281194813519 7.62992121377e-21)
...
)
;

boundaryField
{
    DomainInterior
    {
        type            empty;
    }
    In
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    Up
    {
        type            slip;
    }
    Down
    {
        type            slip;
    }
    Out
    {
        type            zeroGradient;
    }
    Cyl1
    {
        type            rotatingWallVelocity;
        origin          (-1.29904 0 0.5);
        axis            (0 0 1);
        omega           tableFile;
        file            "$FOAM_CASE/control2";
    }
    Cyl2
    {
        type            rotatingWallVelocity;
        origin          (0 -0.75 0.5);
        axis            (0 0 1);
        omega           tableFile;
        file            "$FOAM_CASE/control0";
    }
    Cyl3
    {
        type            rotatingWallVelocity;
        origin          (0 0.75 0.5);
        axis            (0 0 1);
        omega           tableFile;
        file            "$FOAM_CASE/control1";
    }
    DomainInterior_top
    {
        type            empty;
    }
}


// ************************************************************************* //
