OpenFOAM/problems/fluidicPinball/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
47927
(
0.202922692852
0.203498376724
0.206678320888
0.211988091471
0.219709923349
0.229214468649
0.240763107094
0.253263386038
...
)
;

boundaryField
{
    DomainInterior
    {
        type            empty;
    }
    In
    {
        type            zeroGradient;
    }
    Up
    {
        type            slip;
    }
    Down
    {
        type            slip;
    }
    Out
    {
        type            fixedValue;
        value           uniform 0;
    }
    Cyl1
    {
        type            zeroGradient;
    }
    Cyl2
    {
        type            zeroGradient;
    }
    Cyl3
    {
        type            zeroGradient;
    }
    DomainInterior_top
    {
        type            empty;
    }
}


// ************************************************************************* //
